Tekla Open API Reference for Tekla Structures 2025
UserPropertyItem.GetOptions Method (List<KeyValuePair<Double, String>>)
 Gets the value options of a double property. Option strings are translated when translation is available.
 Namespace: Tekla.Structures.Catalogs
 Assembly: Tekla.Structures.Catalogs (in Tekla.Structures.Catalogs.dll) Version: 2025.0.0-alpha00048669+a99462f17964bc42624ada6e8d316db2d795d226
Syntax
public bool GetOptions(
	ref List<KeyValuePair<double, string>> DoubleOptions
)
Public Function GetOptions (
	ByRef DoubleOptions As List(Of KeyValuePair(Of Double, String))
) As Boolean
Parameters
DoubleOptions
Type: System.Collections.Generic.List<KeyValuePair<Double, String>>
The value options.
Return Value
Type: Boolean
True on success.
See Also
Reference
UserPropertyItem Class
GetOptions Overload
Tekla.Structures.Catalogs Namespace